0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/constants"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet {
        type  fixedValue;
        value $internalField;
    }

    outlet {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ground {
        type            omegaWallFunction;
        value           $internalField;
    }

    walls {
        type            omegaWallFunction;
        value           $internalField;
    }

    "(fsae).*" {
        type            omegaWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
